# Clone of cat(1) with syntax highlighting and Git integration
tap "kcl-lang/tap"
brew "kcl-lang/tap/kcl"
tap "KusionStack/tap"
brew "KusionStack/tap/kusion"
tap "ariga/tap"
brew "ariga/tap/atlas"
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
brew "metalbear-co/mirrord/mirrord"

# brew "1password-cli"
# brew "broot"
tap "dapr/tap"
brew "dapr/tap/dapr-cli"
tap "hashicorp/tap"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/terraform"
brew "tbls"
brew "mise"
brew "mprocs"
brew "carapace"
brew "lefthook"
brew "opencode"
brew "pgcli"
brew "yazi"
brew "wrk"
brew "direnv"
brew "ffmpeg"
brew "zoxide"
brew "jq"
brew "poppler"
brew "fd"
brew "ripgrep"
brew "p7zip"
brew "ImageMagick"
brew "jj"
brew "hey"
brew "bottom"
brew "nx"
brew "zenith"
# AI agents
# brew "gemini-cli"
cask "codex"
cask "claude-code"

brew "yq"
brew "doctl"
brew "zellij"
brew "ripgrep"
brew "ollama"
# brew "devbox"
brew "rbenv"
brew "httpie"
brew "htop"
brew "upbound/tap/up"
brew "protobuf"
brew "istioctl"
brew "crossplane"
brew "stefanprodan/tap/timoni"
brew "deno"
brew "oven-sh/bun/bun"
brew "buf"
brew "just"
brew "testkube"
brew "popeye"
brew "kubent"
brew "argo"
brew "uv"
brew "vals"
brew "kubescape"
brew "bacon"
brew "nushell"
brew "fzf"
brew "bat"
brew "go-task"
brew "kustomize"
brew "stow"
brew "starship"
brew "vcluster"
brew "kubevela"
brew "kubeseal"
brew "k9s"
brew "kind"
brew "gh"
brew "lazygit"
brew "argocd"
brew "zig"
brew "node"
brew "tokei"
brew "awscli"
brew "helm"
brew "kompose"
brew "minikube"
brew "kubectx"
brew "pulumi"
brew "tilt"
brew "trivy"
brew "tlrc"
brew "duf"
brew "eza"
brew "langgraph-cli"
brew "tektoncd-cli"
cask "raycast"
cask "visual-studio-code"
cask "warp"
cask "discord"
cask "mongodb-compass"
cask "microsoft-teams"
cask "zoom"
cask "obsidian"
cask "pgadmin4"
cask "medis"
cask "redis-insight"
cask "lm-studio"
cask "zed"
cask "google-chrome"
cask "zen"
cask "slack"
cask "chatgpt"
cask "claude"
cask "tg-pro"
cask "cursor"
cask "1password"
cask "lens"
cask "coderabbit"
cask "postman"
cask "httpie-desktop"
# cask "gcloud-cli"
# cask "docker"
# cask "jetbrains-toolbox"
